{
  "next.config.ts": {
    "md5": "d2791c2f029e63662adc384e69b106b9",
    "description": "O arquivo `next.config.ts` configura opções para um projeto Next.js, permitindo o carregamento de imagens de qualquer origem remota, tanto via HTTPS quanto HTTP, através de padrões de hostname.",
    "lastUpdated": "2025-06-09T17:53:11.671Z"
  },
  "playwright.config.ts": {
    "md5": "ebd20208d893b04f8d899a5b73b81a53",
    "description": "O arquivo `playwright.config.ts` configura o ambiente de testes automatizados utilizando Playwright, especificando diretórios de testes, opções de execução (como paralelismo e retries), definições de projetos para diferentes navegadores (Chromium, Firefox, WebKit) e configurações do servidor web local para rodar os testes.",
    "lastUpdated": "2025-06-09T17:53:13.087Z"
  },
  "src/api/auth.request.ts": {
    "md5": "e79c31ee543455343dbdd29c78e0a2d7",
    "description": "O arquivo `auth.request.ts` define uma interface para requisições de login e uma estrutura de resposta de autenticação, além de implementar uma função assíncrona `login` que envia dados de login para uma API e retorna informações do usuário e dados adicionais sobre bairros, cidades e tipos.",
    "lastUpdated": "2025-06-09T17:53:15.070Z"
  },
  "src/api/base.ts": {
    "md5": "7da87aa0db0421b5ed2c7111db8191cb",
    "description": "O arquivo `base.ts` configura uma instância do Axios para realizar requisições HTTP, definindo um `baseURL` e cabeçalhos padrão. Ele define interfaces TypeScript para estruturar respostas de API, incluindo sucesso, erro e filtros de busca. Além disso, implementa um interceptor de resposta que trata erros, transformando-os em um formato tipado `APIError`, facilitando o manuseio de erros em requisições.",
    "lastUpdated": "2025-06-09T17:53:17.536Z"
  },
  "src/api/properties.request.ts": {
    "md5": "e40e2e157bc74b689b235f02d726622c",
    "description": "O arquivo `properties.request.ts` define uma API para gerenciar propriedades imobiliárias, permitindo buscar, criar, editar e deletar registros de propriedades. Ele inclui interfaces para filtros de busca e dados de formulário, além de funções assíncronas que interagem com um serviço de API para realizar operações CRUD (Create, Read, Update, Delete) sobre as propriedades.",
    "lastUpdated": "2025-06-12T11:40:30.134Z"
  },
  "src/app/(app)/dashboard/page.tsx": {
    "md5": "5e87f6bc389a2e742438b8af59d7ff96",
    "description": "O arquivo `page.tsx` define um componente de página de dashboard que utiliza um contexto de autenticação para gerenciar o estado do usuário. Ele inclui funções para logout e para gerar as iniciais do nome do usuário, mas atualmente não renderiza conteúdo visível na interface, apenas uma div com estilo de fundo.",
    "lastUpdated": "2025-06-12T11:40:31.792Z"
  },
  "src/app/(app)/layout.tsx": {
    "md5": "406131c4d92feae7fbcca98f161ae9ce",
    "description": "O arquivo `layout.tsx` define um layout de aplicativo que envolve os componentes `AuthGuard` e `SidebarProvider`. Ele garante que a autenticação do usuário seja verificada antes de renderizar o conteúdo da aplicação, que inclui uma barra lateral (`AppSidebar`) e o conteúdo principal (`children`). A barra lateral exibe informações do usuário autenticado, como nome e e-mail.",
    "lastUpdated": "2025-06-09T17:53:23.669Z"
  },
  "src/app/(app)/properties/create/page.tsx": {
    "md5": "b712ef918c9ba2ca2fbe514991e1fd4c",
    "description": "O arquivo `page.tsx` implementa uma página para criar propriedades em uma aplicação Next.js. Ele utiliza o componente `PropertiesForm` e define callbacks para lidar com o sucesso, erro e cancelamento da criação de uma propriedade. Além disso, inclui funções para interações como visualizar mapa, abrir site, imprimir, compartilhar no WhatsApp e Facebook, e adicionar ou visualizar fotos. Ao criar uma propriedade com sucesso, redireciona o usuário para a listagem de propriedades.",
    "lastUpdated": "2025-06-09T17:53:26.353Z"
  },
  "src/app/(app)/properties/edit/[id]/page.tsx": {
    "md5": "6aa21b856f18a193a702503844401ed8",
    "description": "O arquivo `page.tsx` define um componente React para editar propriedades em uma aplicação Next.js. Ele utiliza o hook `useRouter` para navegação e recebe parâmetros assíncronos, especificamente um ID de propriedade. O componente exibe um título \"EditPropertyPage\" e contém callbacks comentados para manipular eventos como sucesso, erro e cancelamento durante a atualização da propriedade, além de interações com mapas e compartilhamento em redes sociais.",
    "lastUpdated": "2025-06-12T11:40:34.198Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/parts/index.tsx": {
    "md5": "fb0027a4db4622ad115d8f1da8a07f83",
    "description": "O arquivo `index.tsx` exporta componentes relacionados a filtros de listagem de propriedades, permitindo a utilização de seções específicas como finalidade, características, recursos especiais, filtros de empresa e filtros adicionais em outras partes da aplicação.",
    "lastUpdated": "2025-06-09T17:53:29.948Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/parts/properties-listing-filters--additional-filters.tsx": {
    "md5": "464399d97ff0761ddcb76476d7206bcf",
    "description": "O arquivo define um componente React que renderiza uma seção de filtros adicionais para listagens de imóveis, permitindo que os usuários selecionem opções como \"Apenas imóveis com fotos\", \"Desatualizados\", \"Destaque\", entre outros, por meio de checkboxes.",
    "lastUpdated": "2025-06-09T17:53:31.384Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/parts/properties-listing-filters--company-filters.tsx": {
    "md5": "30785119313968b50b08bde39a540e73",
    "description": "O arquivo define um componente React chamado `PropertiesListingFiltersCompanyFilters`, que exibe uma seção de filtros para listar imóveis. Ele permite que o usuário filtre imóveis da própria imobiliária ou aqueles cadastrados por ele, utilizando checkboxes para seleção.",
    "lastUpdated": "2025-06-09T17:53:32.453Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/parts/properties-listing-filters--finality-section.tsx": {
    "md5": "c7f2a07227fcaf8dc720f84931ee0b86",
    "description": "O arquivo define um componente React que apresenta uma seção de filtros para finalidades de imóveis, permitindo ao usuário selecionar múltiplas opções como venda, locação, temporada, entre outras, por meio de checkboxes.",
    "lastUpdated": "2025-06-09T17:53:33.612Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/parts/properties-listing-filters--property-characteristics.tsx": {
    "md5": "3b145061667d00829d9823f943f6083f",
    "description": "O arquivo define um componente React que exibe filtros para características físicas de imóveis, permitindo ao usuário inserir o número de dormitórios, suítes e vagas disponíveis.",
    "lastUpdated": "2025-06-09T17:53:34.915Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/parts/properties-listing-filters--special-features.tsx": {
    "md5": "d03f2644b525ac618363e1ec6751785c",
    "description": "O arquivo define um componente React que exibe uma seção de filtros para listar propriedades, permitindo que os usuários selecionem características especiais, como piscina, vista para o mar e sacada, por meio de checkboxes.",
    "lastUpdated": "2025-06-09T17:53:35.967Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/properties-listing-filters.ctrl.tsx": {
    "md5": "932c915f4bcafbc5b0e2833d762401a2",
    "description": "O arquivo `properties-listing-filters.ctrl.tsx` define um hook controller para gerenciar a lógica de um formulário de filtros de propriedades. Utiliza o `react-hook-form` com validação via `zod` para configurar e controlar o estado dos filtros, incluindo campos como referência, status, finalidades, características físicas e financeiras, além de localização. Ele também integra hooks personalizados para verificar se o dispositivo é móvel e para obter informações adicionais.",
    "lastUpdated": "2025-06-09T17:53:37.907Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/properties-listing-filters.tsx": {
    "md5": "0292e87d324fe35912b83a797cf3afc5",
    "description": "O arquivo `properties-listing-filters.tsx` implementa um componente de filtros para listagem de propriedades, permitindo que usuários filtrem imóveis com base em critérios como referência, tipo, endereço e características específicas. Utiliza a biblioteca `react-hook-form` para gerenciar o estado dos formulários e inclui elementos de interface como botões, entradas de texto e seletores. O componente é responsivo e adapta-se a dispositivos móveis.",
    "lastUpdated": "2025-06-09T17:53:41.122Z"
  },
  "src/app/(app)/properties/listing/components/properties-listing-filters/properties-listing-filters.types.tsx": {
    "md5": "9ae95331009c70e6530dbc629f4c90d0",
    "description": "O arquivo define um esquema de validação utilizando a biblioteca Zod para os filtros de listagem de propriedades imobiliárias, especificando diversos campos opcionais que permitem filtrar imóveis com base em características como status, finalidade, localização, valores financeiros e características físicas.",
    "lastUpdated": "2025-06-09T17:53:42.551Z"
  },
  "src/app/(app)/properties/listing/page.tsx": {
    "md5": "d0ea1e63103564ae61205ca3aa98865f",
    "description": "O arquivo `page.tsx` é um componente React que importa e exporta o componente `PropertiesListing` da página de listagem de propriedades, permitindo que ele seja utilizado como a página principal em uma aplicação Next.js.",
    "lastUpdated": "2025-06-12T11:40:35.277Z"
  },
  "src/app/(app)/properties/listing/properties-listing.ctrl.tsx": {
    "md5": "ebf0722034975a6ce6869a3c35ac89a7",
    "description": "O arquivo `properties-listing.ctrl.tsx` implementa um controlador para listar propriedades, permitindo filtragem, ordenação e paginação. Utiliza a biblioteca React Query para buscar dados de uma API de propriedades, gerenciando estados como carregamento e erro. Inclui funcionalidades para formatar preços e manipular um dropdown para ações relacionadas às propriedades. Além disso, gerencia a rolagem suave para o container de listagem após as requisições.",
    "lastUpdated": "2025-06-09T17:53:46.397Z"
  },
  "src/app/(app)/properties/listing/properties-listing.tsx": {
    "md5": "9c267e35707b2e57ac009021aa961320",
    "description": "O arquivo `properties-listing.tsx` implementa um componente React para listar propriedades, incluindo um cabeçalho com um botão para adicionar novas propriedades, um filtro de busca, uma tabela para exibir os dados das propriedades e um sistema de paginação. Ele também integra um slider de imagens em tela cheia para visualizar imagens das propriedades selecionadas.",
    "lastUpdated": "2025-06-09T17:53:48.970Z"
  },
  "src/app/(app)/properties/view/[id]/page.tsx": {
    "md5": "47ef8598d8a20f7862879cacdd20715d",
    "description": "O arquivo `page.tsx` define um componente de página em uma aplicação Next.js que permite visualizar detalhes de uma propriedade. Ele utiliza o ID da propriedade passado nos parâmetros para exibir informações e oferece botões para ações como visualizar no mapa, acessar o site, imprimir detalhes e compartilhar via WhatsApp e Facebook. Caso o ID seja inválido, uma mensagem de erro é exibida.",
    "lastUpdated": "2025-06-09T17:53:50.597Z"
  },
  "src/app/layout.tsx": {
    "md5": "1e0db9b69fd3f34f75dbb9c7f3be2a55",
    "description": "O arquivo `layout.tsx` define o layout raiz de uma aplicação Next.js, configurando metadados, importando fontes do Google e aplicando estilos globais. Ele envolve os componentes filhos em um provedor e utiliza classes de fonte para estilização, garantindo que a aplicação tenha uma estrutura consistente e responsiva.",
    "lastUpdated": "2025-06-12T11:40:37.101Z"
  },
  "src/app/page.tsx": {
    "md5": "8dc6e5d602206d0584325241e2884a45",
    "description": "O arquivo `page.tsx` implementa uma página de autenticação em uma aplicação Next.js, que verifica se o usuário está autenticado. Se autenticado, redireciona para o dashboard; se não, exibe uma interface com opções para login ou criação de conta, além de um indicador de carregamento enquanto verifica o estado de autenticação. A página utiliza componentes de UI e um sistema de temas.",
    "lastUpdated": "2025-06-09T17:53:53.631Z"
  },
  "src/app/providers.tsx": {
    "md5": "2cac1eb3b9777a4b38136558191697d4",
    "description": "O arquivo `providers.tsx` define um componente React chamado `Providers`, que encapsula a aplicação em vários provedores de contexto: `QueryClientProvider` para gerenciamento de dados com React Query, `ThemeProvider` para controle de temas, e `AuthProvider` para autenticação, além de incluir um componente `Toaster` para notificações.",
    "lastUpdated": "2025-06-09T17:53:54.877Z"
  },
  "src/components/app-sidebar/app-sidebar.ctrl.tsx": {
    "md5": "62ff0fad1e2051376e32d9bcd50ff612",
    "description": "O arquivo `app-sidebar.ctrl.tsx` define um controlador para uma barra lateral de aplicativo, gerenciando seu estado de expansão ou colapso. Utiliza hooks para sincronizar o estado com um contexto de sidebar, permitindo controle externo e notificações de mudanças. Além disso, organiza os itens do menu em grupos, cada um com títulos e ícones correspondentes, facilitando a navegação dentro do aplicativo.",
    "lastUpdated": "2025-06-09T17:53:56.615Z"
  },
  "src/components/app-sidebar/app-sidebar.stories.tsx": {
    "md5": "07da80382a45a052c5cde9c2ed18d2f7",
    "description": "O arquivo `app-sidebar.stories.tsx` configura histórias para o componente `AppSidebar` no Storybook, permitindo a visualização e interação com o sidebar da aplicação. Ele define propriedades e comportamentos do componente, como dados do usuário, logo, estado de colapso e ações para eventos de clique. Além disso, inclui exemplos de usuários para demonstrar diferentes estados do sidebar.",
    "lastUpdated": "2025-06-12T11:40:39.099Z"
  },
  "src/components/app-sidebar/app-sidebar.tsx": {
    "md5": "0f108080824be3b75a6828702ff0beec",
    "description": "O arquivo `app-sidebar.tsx` define um componente de barra lateral (sidebar) para uma aplicação React, que exibe informações do usuário, nome da empresa e permite navegação através de itens de menu. Ele suporta funcionalidades como colapso, troca de tema e logout, e deve ser utilizado dentro de um `SidebarProvider` para controle de estado.",
    "lastUpdated": "2025-06-09T17:54:00.148Z"
  },
  "src/components/app-sidebar/app-sidebar.types.tsx": {
    "md5": "076ad1698b2aebdec269ad4367aecc9c",
    "description": "O arquivo `app-sidebar.types.tsx` define interfaces TypeScript para tipagem de componentes relacionados a uma barra lateral de aplicativo. Inclui definições para usuários, itens de menu, grupos de menu e propriedades do componente de barra lateral, permitindo a estruturação e manipulação de dados do usuário, navegação e interações dentro da interface do aplicativo.",
    "lastUpdated": "2025-06-09T17:54:01.680Z"
  },
  "src/components/app-sidebar/index.tsx": {
    "md5": "d09fa338180cba7c9a97fe3e38085ba7",
    "description": "O arquivo `index.tsx` exporta componentes e tipos relacionados à barra lateral do aplicativo, incluindo `AppSidebar`, `useAppSidebarCtrl`, e `AppSidebarUser`, além de tipos TypeScript como `AppSidebarProps`, `User`, `MenuItem` e `MenuGroup`.",
    "lastUpdated": "2025-06-09T17:54:03.347Z"
  },
  "src/components/app-sidebar/parts/app-sidebar--user/app-sidebar--user.ctrl.tsx": {
    "md5": "42353762ef6ab721d35b84105422f5da",
    "description": "O arquivo `app-sidebar--user.ctrl.tsx` define um hook React que gerencia a lógica de um componente de sidebar de usuário. Ele controla o estado de um dropdown, permitindo alternar entre temas (claro e escuro), lidar com cliques no perfil do usuário e realizar logout. Além disso, fornece uma função para obter as iniciais do usuário e organiza itens do dropdown com ícones e ações correspondentes.",
    "lastUpdated": "2025-06-09T17:54:05.077Z"
  },
  "src/components/app-sidebar/parts/app-sidebar--user/app-sidebar--user.stories.tsx": {
    "md5": "3d67af310c2d8f98f0ad723e50432c3e",
    "description": "O arquivo define histórias para o componente `AppSidebarUser` no Storybook, permitindo a visualização e interação com diferentes estados do componente, como temas e dados do usuário. Ele inclui exemplos de usuários com diferentes características, como presença ou ausência de avatar e email, e configurações de tema claro e escuro.",
    "lastUpdated": "2025-06-12T11:40:40.645Z"
  },
  "src/components/app-sidebar/parts/app-sidebar--user/app-sidebar--user.tsx": {
    "md5": "e40e09db3b4b0550f4ccea7b8be0cfd0",
    "description": "O arquivo `app-sidebar--user.tsx` implementa um componente de interface do usuário em React que exibe informações do perfil do usuário, incluindo um avatar e nome. Ele contém um botão que, ao ser clicado, exibe um menu suspenso com opções de configurações. O componente utiliza controle de estado para gerenciar a abertura do menu e manipula eventos de clique para interações do usuário.",
    "lastUpdated": "2025-06-09T17:54:08.907Z"
  },
  "src/components/app-sidebar/parts/app-sidebar--user/app-sidebar--user.types.tsx": {
    "md5": "10747e142fed9f0ed8653d292d4c0106",
    "description": "O arquivo define interfaces TypeScript para um componente de sidebar de usuário em um aplicativo, especificando a estrutura dos dados do usuário e as propriedades que o componente deve aceitar, como funções para manipulação de cliques, troca de tema e logout.",
    "lastUpdated": "2025-06-09T17:54:10.146Z"
  },
  "src/components/app-sidebar/parts/app-sidebar--user/index.tsx": {
    "md5": "17e0f01ed6122d69e6133a6c949fb20b",
    "description": "O arquivo `index.tsx` exporta o componente `AppSidebarUser`, um controlador `useAppSidebarUserCtrl` e os tipos `AppSidebarUserProps` e `User` relacionados ao componente `AppSidebarUser`, facilitando a importação desses elementos em outras partes da aplicação.",
    "lastUpdated": "2025-06-09T17:54:11.570Z"
  },
  "src/components/auth/auth-guard.tsx": {
    "md5": "6c7afd96ec59ab1179925a128d72f117",
    "description": "O arquivo `auth-guard.tsx` implementa um componente de proteção de rotas que verifica a autenticação do usuário. Dependendo da propriedade `requireAuth`, ele redireciona o usuário para a página de login ou dashboard, conforme necessário. Enquanto a autenticação está sendo verificada, exibe um carregamento. Se as condições de autenticação forem atendidas, renderiza os filhos do componente; caso contrário, não renderiza nada.",
    "lastUpdated": "2025-06-09T17:54:13.625Z"
  },
  "src/components/filters-container/example.tsx": {
    "md5": "5da3b47d056ee49385641021d2e95fc4",
    "description": "O arquivo `example.tsx` define um componente React que implementa um sistema de filtros para produtos. Ele permite que os usuários busquem produtos por nome, selecionem categorias e definam faixas de preço. O componente se adapta a diferentes tamanhos de tela, exibindo os filtros diretamente no desktop e em um modal no mobile. Os filtros aplicados são registrados no console ao serem submetidos.",
    "lastUpdated": "2025-06-09T17:54:15.397Z"
  },
  "src/components/filters-container/filters-container.ctrl.tsx": {
    "md5": "9837a755a9327999fc52462ddf257412",
    "description": "O arquivo `filters-container.ctrl.tsx` define um hook chamado `useFiltersContainerCtrl`, que gerencia a lógica de um componente de filtro. Ele recebe propriedades como visibilidade, funções de fechamento e submissão, e textos de botão. O hook também detecta se o dispositivo é móvel e fornece funções para lidar com a submissão e o fechamento do modal, retornando informações relevantes para o componente de filtro.",
    "lastUpdated": "2025-06-09T17:54:18.379Z"
  },
  "src/components/filters-container/filters-container.stories.tsx": {
    "md5": "f4f655b9c8cdb8d5d031709733edef82",
    "description": "O arquivo define uma história para o componente `FiltersContainer` no Storybook, que serve como um container adaptável para filtros. No desktop, os filtros são exibidos diretamente, enquanto no mobile, eles aparecem em um modal com um botão de envio. O arquivo também inclui controles para personalizar a visibilidade do modal, o texto do botão de envio, e ações para fechamento e envio. Um exemplo de filtros é fornecido com múltiplos campos de busca.",
    "lastUpdated": "2025-06-12T11:40:43.254Z"
  },
  "src/components/filters-container/filters-container.tsx": {
    "md5": "f320829cd404bcee50150fd26e765fda",
    "description": "O arquivo `filters-container.tsx` define um componente React que exibe filtros de forma diferente em dispositivos desktop e móveis. Em desktop, ele simplesmente renderiza os filhos passados como prop. Em dispositivos móveis, utiliza um modal (Sheet) para apresentar os filtros, incluindo um botão de envio que é habilitado ou desabilitado com base no estado do controle.",
    "lastUpdated": "2025-06-09T17:54:23.904Z"
  },
  "src/components/filters-container/filters-container.types.tsx": {
    "md5": "3024b0177a65975ec5533d86c4ebb530",
    "description": "O arquivo define uma interface TypeScript chamada `FiltersContainerProps`, que especifica as propriedades esperadas para um componente de contêiner de filtros em um modal. Ele inclui opções para conteúdo, visibilidade, funções de fechamento e envio, texto do botão de envio, estado do botão e título do modal, além de permitir classes CSS adicionais.",
    "lastUpdated": "2025-06-09T17:54:26.893Z"
  },
  "src/components/filters-container/index.tsx": {
    "md5": "e53f754fe8c8d6fa94d37ac7521fe2d0",
    "description": "O arquivo `index.tsx` exporta o componente `FiltersContainer` e o tipo `FiltersContainerProps` a partir de seus respectivos módulos, facilitando a importação desses elementos em outras partes da aplicação.",
    "lastUpdated": "2025-06-09T17:54:28.083Z"
  },
  "src/components/photo-upload/index.tsx": {
    "md5": "5504e6bc4efe6a6fbddeb282bb259903",
    "description": "O arquivo `index.tsx` exporta o componente `PhotoUpload` do módulo `photo-upload` e também exporta tipos TypeScript relacionados, incluindo `PhotoUploadProps`, `PhotoFile`, `UploadStatus` e `InitialPhoto`, a partir do arquivo `photo-upload.types`.",
    "lastUpdated": "2025-06-09T17:54:30.324Z"
  },
  "src/components/photo-upload/logic/index.tsx": {
    "md5": "9d092f6fee66b614b5aafb9fc7a7b9e8",
    "description": "O arquivo `index.tsx` exporta quatro hooks personalizados: `useFileValidation`, `useUploadQueue`, `useDragDrop` e `usePhotoReorder`, permitindo que sejam utilizados em outros módulos de forma simplificada.",
    "lastUpdated": "2025-06-09T17:54:33.167Z"
  },
  "src/components/photo-upload/logic/use-drag-drop.tsx": {
    "md5": "9266f8e8aba1f72d729ab4a1117ec89b",
    "description": "O arquivo `use-drag-drop.tsx` define um hook React que implementa a funcionalidade de arrastar e soltar (drag and drop) arquivos. Ele gerencia estados visuais e eventos relacionados ao arrasto de arquivos, permitindo que uma função de callback seja chamada com os arquivos soltos, enquanto fornece feedback visual ao usuário sobre o estado de arrasto. O hook também permite desativar a funcionalidade se necessário.",
    "lastUpdated": "2025-06-09T17:54:35.590Z"
  },
  "src/components/photo-upload/logic/use-file-validation.tsx": {
    "md5": "df3fc56caa6ac217b10fc46175a993b0",
    "description": "O arquivo `use-file-validation.tsx` define um hook React que valida arquivos com base em critérios como tipo, tamanho e quantidade permitida. Ele fornece funções para validar arquivos individuais, verificar se mais arquivos podem ser adicionados e validar um array de arquivos, retornando arquivos válidos e mensagens de erro.",
    "lastUpdated": "2025-06-09T17:54:36.910Z"
  },
  "src/components/photo-upload/logic/use-photo-reorder.tsx": {
    "md5": "3ecb0088a2ec83cc9135d68ef50b3b1c",
    "description": "O arquivo `use-photo-reorder.tsx` implementa um hook React que permite a reordenação de fotos via drag and drop, restringindo essa funcionalidade apenas a fotos com status 'success'. Ele gerencia o estado das fotos arrastadas e sobre as quais se está passando o mouse, além de executar a lógica de reordenação ao soltar uma foto em outra.",
    "lastUpdated": "2025-06-09T17:54:38.569Z"
  },
  "src/components/photo-upload/logic/use-upload-queue.tsx": {
    "md5": "4a820da8e085de5534883df3846e087f",
    "description": "O arquivo `use-upload-queue.tsx` implementa um hook React que gerencia uma fila de upload de fotos, permitindo adicionar, remover e processar uploads de forma sequencial com um limite de concorrência. Ele garante que apenas fotos novas (com objeto File) sejam processadas e fornece funções para atualizar o status do upload e reprocessar fotos que falharam.",
    "lastUpdated": "2025-06-09T17:54:40.125Z"
  },
  "src/components/photo-upload/parts/index.tsx": {
    "md5": "e0aeeaa41257e05e6e64ffe6fefe492f",
    "description": "O arquivo `index.tsx` exporta o componente `PhotoCard` e o tipo `PhotoCardProps` do módulo `photo-upload--card`, permitindo que esses elementos sejam utilizados em outros arquivos do projeto.",
    "lastUpdated": "2025-06-09T17:54:41.185Z"
  },
  "src/components/photo-upload/parts/photo-upload--card.stories.tsx": {
    "md5": "4611f3305c7529da21e0a4502f6bdc23",
    "description": "O arquivo `photo-upload--card.stories.tsx` define histórias para o componente `PhotoCard` utilizando Storybook. Ele cria mocks de arquivos de fotos com diferentes estados (pendente, enviando, sucesso, erro e inicial) e configura propriedades como callbacks para remoção e reenvio. As histórias demonstram como o componente se comporta em diferentes situações, incluindo suporte para arrastar e soltar.",
    "lastUpdated": "2025-06-09T17:54:43.074Z"
  },
  "src/components/photo-upload/parts/photo-upload--card.tsx": {
    "md5": "2d346f3b8333fdddf1c7433b7706cd1a",
    "description": "O arquivo `photo-upload--card.tsx` define um componente React que exibe um cartão de pré-visualização de fotos, permitindo funcionalidades como arrastar e soltar, remoção e tentativa de reenvio. Ele utiliza ícones e imagens do Next.js e inclui lógica para manipulação de eventos de arrastar, além de exibir diferentes estados da foto (como upload e sucesso).",
    "lastUpdated": "2025-06-09T17:54:45.656Z"
  },
  "src/components/photo-upload/parts/photo-upload--card.types.tsx": {
    "md5": "43378ed09eb454fbd3302fba21091479",
    "description": "O arquivo define uma interface TypeScript chamada `PhotoCardProps`, que especifica as propriedades para um componente de card de foto. Este componente exibe uma prévia da foto e oferece controles para remoção e reenvio em caso de erro, além de suportar funcionalidades de arrastar e soltar (drag and drop) com diversos manipuladores de eventos.",
    "lastUpdated": "2025-06-09T17:54:47.137Z"
  },
  "src/components/photo-upload/photo-upload.ctrl.tsx": {
    "md5": "cdc5b06dfed148f62fd301dc09de4b73",
    "description": "O arquivo `photo-upload.ctrl.tsx` implementa um hook React para gerenciar o upload de fotos, permitindo a adição, remoção e reordenação de imagens. Ele controla o estado das fotos, incluindo aquelas já existentes, valida arquivos, e atualiza o status de upload. O componente também permite configurar limites de arquivos, tamanhos e tipos aceitos, além de fornecer callbacks para eventos como mudanças de status e reordenação de fotos.",
    "lastUpdated": "2025-06-09T17:54:48.997Z"
  },
  "src/components/photo-upload/photo-upload.stories.tsx": {
    "md5": "15877df3184397db8429c282cad480df",
    "description": "O arquivo `photo-upload.stories.tsx` define histórias para o componente `PhotoUpload` utilizando Storybook. Ele inclui configurações e mocks de fotos iniciais, permitindo a demonstração de funcionalidades como upload, remoção e reordenação de fotos. As histórias incluem um exemplo padrão sem fotos iniciais e outro com fotos pré-carregadas, além de definir propriedades como limites de arquivos e tipos aceitos.",
    "lastUpdated": "2025-06-09T17:54:50.637Z"
  },
  "src/components/photo-upload/photo-upload.tsx": {
    "md5": "dc2f18abd793d53fa44fdf4f7c399b91",
    "description": "O arquivo `photo-upload.tsx` implementa um componente React para upload de fotos, permitindo arrastar e soltar ou clicar para selecionar arquivos. Ele exibe uma área de upload visualmente interativa e uma grade de fotos selecionadas, com funcionalidades para remover, tentar novamente o upload e arrastar as imagens. O componente também exibe estatísticas sobre o upload das fotos.",
    "lastUpdated": "2025-06-09T17:54:56.612Z"
  },
  "src/components/photo-upload/photo-upload.types.tsx": {
    "md5": "811c1de22da47b35d4dec0f4ae0ffde6",
    "description": "O arquivo `photo-upload.types.tsx` define tipos e interfaces para gerenciar o upload de fotos em um componente React. Ele especifica os estados de upload, estruturas para fotos iniciais e arquivos de foto, além de propriedades para o componente de upload, como funções de callback para manipulação de uploads, remoção de fotos, reordenação e validações de arquivos.",
    "lastUpdated": "2025-06-09T17:54:58.722Z"
  },
  "src/components/properties-form/index.tsx": {
    "md5": "678a8175e1bdb708320ca98011bec46b",
    "description": "O arquivo `index.tsx` exporta o componente `PropertiesForm` do módulo `properties-form` e também exporta tipos TypeScript relacionados, como `PropertiesFormProps`, `PropertiesFormData` e `PropertiesFormState`, a partir do arquivo `properties-form.types`.",
    "lastUpdated": "2025-06-09T17:55:00.281Z"
  },
  "src/components/properties-form/parts/index.ts": {
    "md5": "2c27e37411953892a5d9702bfece3355",
    "description": "O arquivo `index.ts` exporta quatro componentes relacionados a um formulário de propriedades: `PropertiesFormHeader`, `PropertiesFormFooter`, `PropertiesFormDadosGlobais` e `PropertiesFormValores`, permitindo que sejam utilizados em outras partes da aplicação.",
    "lastUpdated": "2025-06-09T17:55:01.560Z"
  },
  "src/components/properties-form/parts/properties-form-dados-globais.tsx": {
    "md5": "23f916eb1ebf9f1cfbbea16c0c207b5e",
    "description": "O arquivo `properties-form-dados-globais.tsx` define um componente React que renderiza um formulário para entrada de dados globais relacionados a imóveis. Ele inclui campos como switches, inputs e checkboxes para informações como tipo de imóvel, referências e finalidades (venda, locação, temporada), permitindo a configuração de SEO. O formulário pode ser configurado como somente leitura, dependendo da propriedade `readonly`.",
    "lastUpdated": "2025-06-09T17:55:03.289Z"
  },
  "src/components/properties-form/parts/properties-form-footer.tsx": {
    "md5": "505e651c0c88eba6a89169b1e1a83530",
    "description": "O arquivo `properties-form-footer.tsx` define um componente de rodapé para um formulário de propriedades em React, que inclui botões para adicionar e visualizar fotos, arquivar (quando em modo de edição) e um botão para salvar ou criar, com funcionalidades condicionais baseadas nas propriedades recebidas.",
    "lastUpdated": "2025-06-09T17:55:04.686Z"
  },
  "src/components/properties-form/parts/properties-form-header.tsx": {
    "md5": "72e265537337ee7799831676643b5a3a",
    "description": "O arquivo `properties-form-header.tsx` define um componente React que exibe um cabeçalho para um formulário de propriedades. Ele mostra um título, indica se há alterações não salvas e oferece botões para ações como visualizar um mapa, acessar um site, imprimir e compartilhar via WhatsApp e Facebook. O componente permite a troca de abas dentro do formulário.",
    "lastUpdated": "2025-06-09T17:55:06.368Z"
  },
  "src/components/properties-form/parts/properties-form-valores.tsx": {
    "md5": "7da7cfad9dfae89e8c80dab0d1bcd588",
    "description": "O arquivo `properties-form-valores.tsx` define um componente React que exibe um formulário para entrada de valores de venda e locação de propriedades. Ele recebe dados do formulário e uma função para atualizar esses campos, permitindo que o usuário insira valores numéricos, com a opção de desabilitar a edição através da propriedade `readonly`.",
    "lastUpdated": "2025-06-09T17:55:08.109Z"
  },
  "src/components/properties-form/properties-form.ctrl.tsx": {
    "md5": "b5bbabe105d31e02d5d35225962c0eeb",
    "description": "O arquivo `properties-form.ctrl.tsx` define um hook React que gerencia o estado e a lógica de um formulário para criação e edição de propriedades. Ele utiliza React Query para buscar dados de uma propriedade existente e realizar mutações para criar ou atualizar propriedades. O hook também controla o estado do formulário, incluindo a verificação de alterações e a navegação entre abas, além de lidar com callbacks de sucesso e erro.",
    "lastUpdated": "2025-06-12T11:40:46.667Z"
  },
  "src/components/properties-form/properties-form.stories.tsx": {
    "md5": "cfdf8c8dee0419a58c83c94a64bc8fcc",
    "description": "O arquivo `properties-form.stories.tsx` configura histórias para o componente `PropertiesForm` no Storybook, permitindo a visualização e interação com o formulário de criação e edição de propriedades. Ele inclui um mock do `QueryClient` do React Query, define parâmetros e controles para personalização, e especifica callbacks para diferentes ações do formulário, como sucesso, erro e interações com botões.",
    "lastUpdated": "2025-06-09T17:55:11.653Z"
  },
  "src/components/properties-form/properties-form.test.tsx": {
    "md5": "cd2424bfb39681321e7d7207a2342d33",
    "description": "O arquivo `properties-form.test.tsx` contém testes automatizados para o componente `PropertiesForm`, utilizando a biblioteca `@testing-library/react`. Ele verifica a renderização do formulário em diferentes modos (criação, edição e visualização), a interação do usuário com os campos do formulário e a funcionalidade de conversão automática de estados para maiúsculas. Mock da API é utilizado para simular chamadas durante os testes.",
    "lastUpdated": "2025-06-09T17:55:13.136Z"
  },
  "src/components/properties-form/properties-form.tsx": {
    "md5": "68d73d7b5965aff7cce02fe43d3cba61",
    "description": "O arquivo `properties-form.tsx` implementa um formulário para gerenciamento de propriedades imobiliárias, utilizando React e a biblioteca `react-hook-form`. Ele configura campos de entrada, tabs para diferentes seções do formulário e exibe estados de carregamento e erro. O formulário permite a criação e edição de dados de propriedades, sincronizando informações com um controlador e exibindo um cabeçalho dinâmico com base no estado atual.",
    "lastUpdated": "2025-06-12T11:40:49.611Z"
  },
  "src/components/properties-form/properties-form.types.tsx": {
    "md5": "d07ee8c21fef6dba3500006d47f0caf9",
    "description": "O arquivo `properties-form.types.tsx` define tipos e interfaces para um componente de formulário de propriedades em um aplicativo React. Ele especifica as abas disponíveis no formulário, as propriedades do componente, incluindo callbacks para ações como sucesso, erro, cancelamento e interações com botões, além de gerenciar o estado do formulário, como carregamento, salvamento e modo de operação (criação, edição ou visualização).",
    "lastUpdated": "2025-06-09T17:55:16.963Z"
  },
  "src/components/slider-images-fullscreen/example.tsx": {
    "md5": "4b08cef238beba5bc9563f8b7ac4d8a6",
    "description": "O arquivo `example.tsx` implementa um componente React chamado `SliderExample`, que exibe uma galeria de imagens em miniatura. Ao clicar em uma imagem, abre um slider em tela cheia com navegação, zoom e contagem de imagens. O componente utiliza hooks para gerenciar o estado da galeria e permite a abertura de uma imagem específica através de botões.",
    "lastUpdated": "2025-06-09T17:55:18.480Z"
  },
  "src/components/slider-images-fullscreen/index.tsx": {
    "md5": "6a0785dcc47a6da8e2b6523c5189cecc",
    "description": "O arquivo `index.tsx` exporta o componente `SliderImagesFullScreen`, um controlador `useSliderImagesFullScreenCtrl` e tipos TypeScript relacionados (`SliderImagesFullScreenProps` e `SliderImage`) de seus respectivos módulos, facilitando a importação desses elementos em outras partes da aplicação.",
    "lastUpdated": "2025-06-09T17:55:20.284Z"
  },
  "src/components/slider-images-fullscreen/slider-images-fullscreen.ctrl.tsx": {
    "md5": "ddfc1106d4971a5c917da4655c163ba7",
    "description": "O arquivo `slider-images-fullscreen.ctrl.tsx` implementa um controle para um slider de imagens em tela cheia, permitindo navegação entre imagens, zoom e manipulação do estado de abertura do slider. Ele gerencia o índice da imagem atual, permite avançar ou retroceder nas imagens, e oferece funcionalidades para aplicar e ajustar o zoom, além de resetar o zoom ao mudar de imagem ou fechar o modal.",
    "lastUpdated": "2025-06-09T17:55:22.727Z"
  },
  "src/components/slider-images-fullscreen/slider-images-fullscreen.stories.tsx": {
    "md5": "eba322ddbcb4abee8c5c6cd7184c47bf",
    "description": "O arquivo `slider-images-fullscreen.stories.tsx` define uma história para o componente `SliderImagesFullScreen` no Storybook, apresentando um slider de imagens em tela cheia. Ele inclui imagens de exemplo, configurações de navegação, controle de exibição e interações por teclado, permitindo visualizar e interagir com o componente de forma responsiva e otimizada para a tela.",
    "lastUpdated": "2025-06-09T17:55:24.969Z"
  },
  "src/components/slider-images-fullscreen/slider-images-fullscreen.test.tsx": {
    "md5": "b731a8c81b1ebe89b0900bfa933beba5",
    "description": "O arquivo `slider-images-fullscreen.test.tsx` contém testes automatizados para um componente de slider de imagens em tela cheia. Ele verifica a estrutura e a interface do tipo `SliderImage`, valida a lógica do controlador `useSliderImagesFullScreenCtrl`, e assegura que as propriedades obrigatórias e opcionais do componente sejam aceitas corretamente. Os testes incluem a verificação de imagens mock e garantem que todas as propriedades necessárias estejam definidas e com os tipos corretos.",
    "lastUpdated": "2025-06-09T17:55:26.802Z"
  },
  "src/components/slider-images-fullscreen/slider-images-fullscreen.tsx": {
    "md5": "2368ef7d3e96614af6b07c0fadf87718",
    "description": "O arquivo `slider-images-fullscreen.tsx` define um componente React que exibe um slider de imagens em tela cheia. Permite navegação entre as imagens, exibição de contador, e funcionalidades de zoom. O componente utiliza um modal para apresentar as imagens e oferece controles de navegação por teclado, além de um botão para fechar o modal.",
    "lastUpdated": "2025-06-09T17:55:28.638Z"
  },
  "src/components/slider-images-fullscreen/slider-images-fullscreen.types.tsx": {
    "md5": "167b5a35a362c42ef675c451b3c8cd50",
    "description": "O arquivo define interfaces TypeScript para um componente de slider de imagens em tela cheia, especificando as propriedades necessárias para exibir imagens, controlar o estado do modal, gerenciar navegação, e personalizar a apresentação, como contadores, botões de navegação e zoom.",
    "lastUpdated": "2025-06-09T17:55:30.316Z"
  },
  "src/components/table-listing/example.tsx": {
    "md5": "0ecd32c0d97c6ad11ed7f480cc0482b0",
    "description": "O arquivo `example.tsx` define um componente React que exibe uma tabela de listagem de usuários, permitindo a ordenação das colunas e a exibição de informações como ID, nome, email, idade, status e data de criação. Utiliza dados de exemplo e componentes de interface para apresentar o status dos usuários com badges.",
    "lastUpdated": "2025-06-12T11:40:51.825Z"
  },
  "src/components/table-listing/index.tsx": {
    "md5": "779f82e887ebd17fb04385b2c869e01e",
    "description": "O arquivo `index.tsx` exporta o componente `TableListing` do módulo `table-listing` e também exporta tipos TypeScript relacionados, incluindo `TableListingProps`, `ColumnConfig`, `SortState` e `SortDirection`, a partir do módulo `table-listing.types`.",
    "lastUpdated": "2025-06-09T17:55:33.702Z"
  },
  "src/components/table-listing/table-listing.ctrl.tsx": {
    "md5": "38e5dd5afda844adac63ae269bdf4c72",
    "description": "O arquivo `table-listing.ctrl.tsx` implementa um hook React que gerencia a lógica de uma tabela, incluindo ordenação, seleção de itens e controle de estado. Ele permite definir colunas, mensagens de carregamento e manipular a seleção de itens, tanto individualmente quanto em massa. O hook também fornece funcionalidades para verificar se itens estão selecionados e se todos os itens estão selecionados, facilitando a interação com listas de dados em uma interface.",
    "lastUpdated": "2025-06-12T11:40:54.562Z"
  },
  "src/components/table-listing/table-listing.stories.tsx": {
    "md5": "1790ba0df60fae35a7c8d9e41b835925",
    "description": "O arquivo `table-listing.stories.tsx` define histórias para o componente `TableListing` no Storybook, permitindo a visualização e teste de suas funcionalidades. Ele inclui configurações para exibir dados em uma tabela responsiva, com opções de ordenação, estados de carregamento, mensagens personalizadas, e exibição de linhas destacadas ou zebradas. Histórias específicas demonstram diferentes estados do componente, como tabela vazia, carregando, com seleção e ordenação.",
    "lastUpdated": "2025-06-12T11:40:56.376Z"
  },
  "src/components/table-listing/table-listing.styles.tsx": {
    "md5": "710d5162804ba824f019437c22b2a3cf",
    "description": "O arquivo `table-listing.styles.tsx` define estilos customizados para uma tabela responsiva em um aplicativo React, utilizando a biblioteca `classnames` para aplicar classes condicionalmente. Ele inclui estilos para o container, cabeçalhos, células, estados de carregamento e vazio, além de variações como tabelas listradas, compactas e com bordas. A função `getTableStyles` permite aplicar esses estilos com base em opções específicas.",
    "lastUpdated": "2025-06-09T17:55:38.982Z"
  },
  "src/components/table-listing/table-listing.tsx": {
    "md5": "7238015830287e9c9d01cc2586564e44",
    "description": "O arquivo `table-listing.tsx` define um componente React que renderiza uma tabela responsiva com funcionalidades de ordenação e seleção. Ele utiliza a biblioteca `react-super-responsive-table` para a estrutura da tabela e inclui ícones para indicar a direção da ordenação. O componente também gerencia estados de carregamento e permite a personalização de colunas, além de integrar checkboxes para seleção de itens.",
    "lastUpdated": "2025-06-12T11:40:58.146Z"
  },
  "src/components/table-listing/table-listing.types.tsx": {
    "md5": "baefec3410a9caa30c9eb27208b4b0e5",
    "description": "O arquivo `table-listing.types.tsx` define tipos e interfaces TypeScript para um componente de tabela em React. Ele especifica a configuração das colunas, o estado de ordenação, e as propriedades do componente, permitindo a exibição de itens em uma tabela com funcionalidades como ordenação, seleção, carregamento e personalização de estilos.",
    "lastUpdated": "2025-06-12T11:40:59.563Z"
  },
  "src/components/theme-toggle.tsx": {
    "md5": "ce776cb74f569c4ff371d5e93a041b48",
    "description": "O arquivo `theme-toggle.tsx` implementa um componente React que permite ao usuário alternar entre temas claro, escuro e do sistema em uma aplicação Next.js. Utiliza um menu suspenso para apresentar as opções de tema e ícones de sol e lua para indicar os modos.",
    "lastUpdated": "2025-06-09T17:55:44.307Z"
  },
  "src/components/ui/accordion.tsx": {
    "md5": "6f5ac2a39c951069d52ef56e1375d70a",
    "description": "O arquivo `accordion.tsx` define um componente de acordeão utilizando a biblioteca Radix UI. Ele exporta quatro componentes: `Accordion`, `AccordionItem`, `AccordionTrigger` e `AccordionContent`, que permitem criar uma interface interativa onde os usuários podem expandir ou colapsar seções de conteúdo. O componente inclui ícones e estilos personalizados para melhorar a usabilidade e a aparência.",
    "lastUpdated": "2025-06-09T17:55:46.024Z"
  },
  "src/components/ui/alert-dialog.tsx": {
    "md5": "0a52d56b575340a3297c172f22d797ae",
    "description": "O arquivo `alert-dialog.tsx` implementa um componente de diálogo de alerta utilizando a biblioteca Radix UI. Ele define várias subcomponentes, como `AlertDialogTrigger`, `AlertDialogContent`, `AlertDialogHeader`, `AlertDialogFooter`, `AlertDialogTitle` e `AlertDialogDescription`, que permitem criar e personalizar um diálogo modal com sobreposição, animações e estilos específicos.",
    "lastUpdated": "2025-06-09T17:55:47.485Z"
  },
  "src/components/ui/alert.tsx": {
    "md5": "8e59179ed2f0f6e33320d0081b9782fa",
    "description": "O arquivo `alert.tsx` define um componente de alerta em React, que permite exibir mensagens com diferentes variantes de estilo (padrão e destrutivo). Ele inclui subcomponentes para o título e a descrição do alerta, utilizando a biblioteca `class-variance-authority` para gerenciar classes CSS de forma condicional. O componente é configurável através de propriedades e é projetado para ser acessível, utilizando atributos ARIA.",
    "lastUpdated": "2025-06-09T17:55:50.250Z"
  },
  "src/components/ui/aspect-ratio.tsx": {
    "md5": "be7a9b030095db724fb3d9ca4e62293c",
    "description": "O arquivo `aspect-ratio.tsx` define um componente React chamado `AspectRatio`, que utiliza o componente `Root` da biblioteca `@radix-ui/react-aspect-ratio`. Ele permite criar um contêiner com uma proporção de aspecto específica, repassando todas as propriedades recebidas para o componente `Root`.",
    "lastUpdated": "2025-06-09T17:55:52.106Z"
  },
  "src/components/ui/avatar.tsx": {
    "md5": "19bc4411b724fb504c65550b61a453b1",
    "description": "O arquivo `avatar.tsx` define componentes de avatar utilizando a biblioteca Radix UI, incluindo `Avatar`, `AvatarImage` e `AvatarFallback`. Esses componentes permitem exibir imagens de perfil com suporte a fallback, estilizados com classes utilitárias.",
    "lastUpdated": "2025-06-09T17:55:53.375Z"
  },
  "src/components/ui/badge.tsx": {
    "md5": "8162fc70aeb50791309f57f8f845d533",
    "description": "O arquivo `badge.tsx` define um componente React chamado `Badge`, que permite criar badges estilizados com diferentes variantes (como padrão, secundário, destrutivo e contorno) utilizando a biblioteca `class-variance-authority`. O componente aceita propriedades para personalização e pode ser renderizado como um elemento `span` ou um componente filho, aplicando classes CSS específicas para estilo e interatividade.",
    "lastUpdated": "2025-06-09T17:55:56.420Z"
  },
  "src/components/ui/breadcrumb.tsx": {
    "md5": "14763038175abd2410d97d8166c89480",
    "description": "O arquivo `breadcrumb.tsx` define componentes React para criar uma navegação em breadcrumb, incluindo elementos como lista, itens, links, separadores e uma representação de ellipsis. Ele utiliza a biblioteca Radix e ícones da Lucide para estilização e acessibilidade, permitindo uma estrutura flexível e personalizável para navegação hierárquica em aplicações web.",
    "lastUpdated": "2025-06-09T17:55:58.062Z"
  },
  "src/components/ui/button.tsx": {
    "md5": "ad4dcf315671aa0a8f16071499ad33d3",
    "description": "O arquivo `button.tsx` define um componente de botão reutilizável em React, utilizando a biblioteca Radix UI e a class-variance-authority para gerenciar variantes de estilo. O botão suporta diferentes variantes (como \"default\", \"destructive\", \"outline\", etc.) e tamanhos (como \"default\", \"sm\", \"lg\"), permitindo personalização através de props. Ele pode ser renderizado como um elemento \"button\" ou como um \"Slot\", dependendo da prop `asChild`.",
    "lastUpdated": "2025-06-12T11:41:01.827Z"
  },
  "src/components/ui/calendar.tsx": {
    "md5": "e95f78f0831354db33431bfc8435e3c4",
    "description": "O arquivo `calendar.tsx` define um componente de calendário personalizado utilizando a biblioteca `react-day-picker`. Ele permite a seleção de datas, com suporte para exibir dias fora do mês atual e personalização de estilos através de classes CSS. O componente inclui botões de navegação para mudar entre meses e utiliza ícones de seta para facilitar a navegação.",
    "lastUpdated": "2025-06-09T17:56:01.820Z"
  },
  "src/components/ui/card.tsx": {
    "md5": "a1468e2e35dfde14b63b4308cd20d2c2",
    "description": "O arquivo `card.tsx` define um conjunto de componentes React para criar um cartão estilizado, incluindo `Card`, `CardHeader`, `CardTitle`, `CardDescription`, `CardAction`, `CardContent` e `CardFooter`. Cada componente permite a personalização de classes e propriedades, facilitando a construção de uma interface de usuário modular e reutilizável.",
    "lastUpdated": "2025-06-09T17:56:03.478Z"
  },
  "src/components/ui/carousel.tsx": {
    "md5": "b28bf29b5dccd43ddfa5fd7d38e8517f",
    "description": "O arquivo `carousel.tsx` implementa um componente de carrossel utilizando a biblioteca `embla-carousel-react`. Ele permite a navegação entre itens em um layout horizontal ou vertical, gerenciando estados de rolagem e interações por meio de setas e teclado. O componente fornece um contexto para compartilhar a API do carrossel e suas funcionalidades, como rolar para frente e para trás, além de verificar se é possível rolar em cada direção.",
    "lastUpdated": "2025-06-09T17:56:07.489Z"
  },
  "src/components/ui/chart.tsx": {
    "md5": "79030ea8a0db990faf5a06180d40b274",
    "description": "O arquivo `chart.tsx` define um componente React chamado `ChartContainer`, que utiliza a biblioteca Recharts para renderizar gráficos responsivos. Ele fornece um contexto para configuração de temas e cores, permitindo personalizar a aparência dos gráficos com base em um objeto de configuração. O componente também aplica estilos dinâmicos para diferentes temas (claro e escuro) e encapsula a lógica de renderização dos gráficos, incluindo um sistema de tooltip.",
    "lastUpdated": "2025-06-09T17:56:09.696Z"
  },
  "src/components/ui/checkbox.tsx": {
    "md5": "dedab00c4cdb4d1a968d9737224a423f",
    "description": "O arquivo `checkbox.tsx` define um componente de checkbox personalizado utilizando React e Radix UI. Ele integra-se com o contexto de formulários do React Hook Form, permitindo o registro e a manipulação do estado do checkbox. O componente exibe um rótulo opcional e mensagens de erro, além de estilizar o checkbox com classes CSS. O estado do checkbox é gerenciado e atualizado conforme a interação do usuário.",
    "lastUpdated": "2025-06-12T11:41:04.103Z"
  },
  "src/components/ui/collapsible.tsx": {
    "md5": "3280feca735918afc1e61fa59ba6e3f3",
    "description": "O arquivo `collapsible.tsx` define componentes React que encapsulam funcionalidades de um colapsável utilizando a biblioteca Radix UI. Ele exporta três componentes: `Collapsible`, `CollapsibleTrigger` e `CollapsibleContent`, permitindo a criação de seções expansíveis e retráteis em uma interface de usuário.",
    "lastUpdated": "2025-06-09T17:56:12.705Z"
  },
  "src/components/ui/command.tsx": {
    "md5": "5632786c44eaa58e5110088afcfb48a6",
    "description": "O arquivo `command.tsx` implementa um componente de interface de usuário para uma paleta de comandos, permitindo que os usuários busquem e executem comandos. Ele utiliza componentes do `cmdk` para criar uma interface de diálogo que inclui um campo de entrada, uma lista de comandos, e suporte para grupos e estados vazios. O design é personalizável e inclui ícones e estilos específicos.",
    "lastUpdated": "2025-06-09T17:56:14.325Z"
  },
  "src/components/ui/context-menu.tsx": {
    "md5": "ae9a7bdee410df0b5d0380784c3a2d16",
    "description": "O arquivo `context-menu.tsx` define componentes para um menu de contexto utilizando a biblioteca Radix UI. Ele inclui componentes como `ContextMenu`, `ContextMenuTrigger`, `ContextMenuGroup`, entre outros, que permitem criar menus interativos com submenus e opções de seleção. Os componentes são estilizados e configuráveis, facilitando a implementação de menus contextuais em aplicações React.",
    "lastUpdated": "2025-06-09T17:56:16.005Z"
  },
  "src/components/ui/dialog.tsx": {
    "md5": "48a74bc4e6b2a9609c91582cae95730f",
    "description": "O arquivo `dialog.tsx` implementa um componente de diálogo utilizando a biblioteca Radix UI, fornecendo funcionalidades como abertura, fechamento e sobreposição. Ele define componentes para o diálogo, gatilho, portal, sobreposição, conteúdo, cabeçalho e rodapé, permitindo personalização através de props e classes CSS. O diálogo inclui um botão de fechamento opcional e animações de transição para estados abertos e fechados.",
    "lastUpdated": "2025-06-09T17:56:17.802Z"
  },
  "src/components/ui/drawer.tsx": {
    "md5": "47179da18b12f0dfb519c6191302a492",
    "description": "O arquivo `drawer.tsx` define um componente de interface de usuário para um \"drawer\" (painel deslizante) utilizando a biblioteca Vaul. Ele inclui componentes para o drawer em si, gatilho, portal, fechamento, sobreposição e conteúdo, permitindo a criação de um painel deslizante personalizável com animações e estilos responsivos.",
    "lastUpdated": "2025-06-09T17:56:19.558Z"
  },
  "src/components/ui/dropdown-menu.tsx": {
    "md5": "61ed555c8e1fdeb8556a276a1721c8d4",
    "description": "O arquivo `dropdown-menu.tsx` define um componente de menu suspenso (dropdown) utilizando a biblioteca Radix UI. Ele encapsula diversos subcomponentes, como `DropdownMenu`, `DropdownMenuTrigger`, `DropdownMenuContent`, `DropdownMenuGroup` e `DropdownMenuItem`, permitindo a criação de menus interativos e personalizáveis com animações e estilos específicos.",
    "lastUpdated": "2025-06-09T17:56:20.881Z"
  },
  "src/components/ui/form.tsx": {
    "md5": "06437ddc30eab3a60f7a561dbc2970ba",
    "description": "O arquivo `form.tsx` implementa um sistema de formulários utilizando React e a biblioteca `react-hook-form`. Ele define componentes como `FormField`, `FormItem`, `FormLabel`, `FormControl` e `FormDescription`, que gerenciam o estado e a validação dos campos do formulário. O código utiliza contextos para compartilhar informações entre os componentes, facilitando a integração e a manipulação dos dados do formulário.",
    "lastUpdated": "2025-06-09T17:56:22.896Z"
  },
  "src/components/ui/hover-card.tsx": {
    "md5": "a1010352934f4cdf860caa32491a3706",
    "description": "O arquivo `hover-card.tsx` define um componente de cartão flutuante utilizando a biblioteca Radix UI. Ele exporta três componentes: `HoverCard`, `HoverCardTrigger` e `HoverCardContent`, que permitem criar um cartão que aparece ao passar o mouse sobre um elemento disparador. O conteúdo do cartão é estilizado com animações e classes CSS personalizadas.",
    "lastUpdated": "2025-06-09T17:56:24.327Z"
  },
  "src/components/ui/input-otp.tsx": {
    "md5": "2598c4a03345f4d67397f90c3fbbaddb",
    "description": "O arquivo `input-otp.tsx` define componentes React para criar uma interface de entrada de código OTP (One-Time Password). Ele inclui o componente principal `InputOTP`, que utiliza o `OTPInput` de uma biblioteca externa, além de componentes auxiliares como `InputOTPGroup`, `InputOTPSlot` e `InputOTPSeparator`, permitindo a personalização e organização visual dos campos de entrada OTP.",
    "lastUpdated": "2025-06-09T17:56:26.947Z"
  },
  "src/components/ui/input.tsx": {
    "md5": "610f61f5985e660a8ec2e6a1b5413a80",
    "description": "O arquivo `input.tsx` define um componente de entrada (input) em React que integra com o contexto de formulário do `react-hook-form`. Ele exibe um rótulo opcional, gerencia mensagens de erro e aplica estilos personalizados ao campo de entrada, além de registrar o input no contexto do formulário, se disponível.",
    "lastUpdated": "2025-06-12T11:41:05.837Z"
  },
  "src/components/ui/label.tsx": {
    "md5": "14f124762142b39a666ce10d3b42d28c",
    "description": "O arquivo `label.tsx` define um componente de rótulo personalizado utilizando o Radix UI, que aplica estilos e classes CSS adicionais, permitindo a integração com props e a manipulação de estados de desabilitação.",
    "lastUpdated": "2025-06-09T17:56:30.143Z"
  },
  "src/components/ui/menubar.tsx": {
    "md5": "f3836779da2e4f6a90dd7f2755f4c61e",
    "description": "O arquivo `menubar.tsx` define um componente de menubar utilizando a biblioteca Radix UI, oferecendo várias subcomponentes como `MenubarMenu`, `MenubarGroup`, `MenubarTrigger`, entre outros. Ele estiliza e organiza a estrutura do menubar, permitindo a criação de menus interativos com suporte a diferentes estados e estilos personalizados.",
    "lastUpdated": "2025-06-09T17:56:31.401Z"
  },
  "src/components/ui/navigation-menu.tsx": {
    "md5": "bea6b8a7ef7d7e7d5dc09afe7631fb59",
    "description": "O arquivo `navigation-menu.tsx` define um componente de menu de navegação utilizando React e a biblioteca Radix UI. Ele inclui componentes para o menu, lista, itens, gatilho e conteúdo, permitindo a criação de um menu interativo e estilizado. O menu é configurável, suportando animações e estilos personalizados, e inclui um ícone de seta para indicar opções expansíveis.",
    "lastUpdated": "2025-06-09T17:56:35.518Z"
  },
  "src/components/ui/pagination.tsx": {
    "md5": "bc8734b1fc2342f8aa7d3bf6517eb4fb",
    "description": "O arquivo `pagination.tsx` implementa um componente de paginação em React, permitindo a navegação entre páginas de um conjunto de dados. Ele calcula o número total de páginas com base no limite e total de itens, gerencia a exibição de páginas, incluindo botões de navegação e elipses para indicar páginas omitidas, e chama funções de callback para alterar a página e o deslocamento quando o usuário interage com os botões de paginação.",
    "lastUpdated": "2025-06-12T11:41:07.435Z"
  },
  "src/components/ui/popover.tsx": {
    "md5": "d7255316c532c766cee7792d775e4d0f",
    "description": "O arquivo `popover.tsx` define componentes React para criar um popover utilizando a biblioteca Radix UI. Ele exporta quatro componentes: `Popover`, `PopoverTrigger`, `PopoverContent` e `PopoverAnchor`, permitindo a criação de popovers personalizáveis com animações e estilos específicos.",
    "lastUpdated": "2025-06-09T17:56:39.609Z"
  },
  "src/components/ui/progress.tsx": {
    "md5": "d0578ee4fb52d86376172c83fb67a9ba",
    "description": "O arquivo `progress.tsx` define um componente de barra de progresso utilizando a biblioteca Radix UI. Ele recebe propriedades como `className` e `value`, e renderiza uma barra de progresso estilizada, onde o indicador de progresso se ajusta com base no valor fornecido, representando visualmente o progresso em relação a um total.",
    "lastUpdated": "2025-06-09T17:56:41.189Z"
  },
  "src/components/ui/radio-group.tsx": {
    "md5": "f01ed4bbe1c1eb73013d07847691ef41",
    "description": "O arquivo `radio-group.tsx` define um componente de grupo de botões de rádio utilizando React e Radix UI. Ele integra o contexto de formulários do React Hook Form, permitindo registrar e gerenciar o estado dos botões de rádio. O componente exibe um título opcional, renderiza as opções de rádio e exibe mensagens de erro, se houver.",
    "lastUpdated": "2025-06-12T11:41:09.348Z"
  },
  "src/components/ui/resizable.tsx": {
    "md5": "e6bc37b4f3397d034e51f987d66ebd48",
    "description": "O arquivo `resizable.tsx` define componentes React para criar um grupo de painéis redimensionáveis utilizando a biblioteca `react-resizable-panels`. Ele inclui um grupo de painéis (`ResizablePanelGroup`), um painel individual (`ResizablePanel`) e um manipulador de redimensionamento (`ResizableHandle`), permitindo que os usuários ajustem o tamanho dos painéis de forma interativa.",
    "lastUpdated": "2025-06-09T17:56:45.586Z"
  },
  "src/components/ui/scroll-area.tsx": {
    "md5": "360243727fcdcb4d509af4516aaa9d0d",
    "description": "O arquivo `scroll-area.tsx` define um componente de área de rolagem personalizável utilizando a biblioteca Radix UI. Ele cria uma área de rolagem com um viewport e barras de rolagem, permitindo que os usuários naveguem por conteúdos que excedem o espaço visível. O componente também aplica estilos e classes CSS para personalização visual.",
    "lastUpdated": "2025-06-09T17:56:47.060Z"
  },
  "src/components/ui/select.tsx": {
    "md5": "641e42d525e57a37a9e7824f67b2ac9e",
    "description": "O arquivo `select.tsx` define um componente de seleção personalizado em React, utilizando a biblioteca Radix UI. Ele integra-se com o contexto de formulários do React Hook Form, permitindo registrar opções de seleção, gerenciar valores e exibir mensagens de erro. O componente renderiza um rótulo, um campo de seleção com opções fornecidas e exibe erros de validação, se houver.",
    "lastUpdated": "2025-06-12T11:41:11.092Z"
  },
  "src/components/ui/separator.tsx": {
    "md5": "07b35dc35f811b26a1ee3982582ba9fb",
    "description": "O arquivo `separator.tsx` define um componente React chamado `Separator`, que utiliza o componente `SeparatorPrimitive` da biblioteca Radix UI para criar um separador estilizado. Ele permite personalizar a orientação (horizontal ou vertical) e a classe CSS, aplicando estilos específicos para cada orientação.",
    "lastUpdated": "2025-06-09T17:56:50.047Z"
  },
  "src/components/ui/sheet.tsx": {
    "md5": "638d6ec8d932fb7adbcd6f58ad1d8475",
    "description": "O arquivo `sheet.tsx` define um componente de interface de usuário chamado \"Sheet\", que utiliza a biblioteca Radix UI para criar um painel deslizante (sheet) que pode ser aberto e fechado. Ele inclui componentes para o conteúdo do painel, gatilho, fechamento e sobreposição, permitindo personalização de estilo e animações ao interagir com o painel.",
    "lastUpdated": "2025-06-09T17:56:52.290Z"
  },
  "src/components/ui/sidebar.tsx": {
    "md5": "6ac31dcffb37c64e92da409440b80f9b",
    "description": "O arquivo `sidebar.tsx` implementa um componente de sidebar responsivo em React, que permite alternar entre os estados expandido e colapsado. Ele utiliza um contexto para gerenciar o estado da sidebar, incluindo a funcionalidade de abrir/fechar em dispositivos móveis e a persistência do estado através de cookies. Além disso, oferece um atalho de teclado para togglar a sidebar.",
    "lastUpdated": "2025-06-09T17:56:54.117Z"
  },
  "src/components/ui/skeleton.tsx": {
    "md5": "ee5017bac14efeda715feaceb488382a",
    "description": "O arquivo `skeleton.tsx` define um componente React chamado `Skeleton`, que renderiza um elemento `<div>` com classes CSS para estilização e animação de carregamento. Ele aceita propriedades adicionais e permite a personalização através da prop `className`.",
    "lastUpdated": "2025-06-09T17:56:55.528Z"
  },
  "src/components/ui/slider.tsx": {
    "md5": "d72c2e0760fae2d1d586db1f8e2c50f9",
    "description": "O arquivo `slider.tsx` define um componente de slider personalizável em React, utilizando a biblioteca Radix UI. Ele permite selecionar valores dentro de um intervalo definido por `min` e `max`, com suporte para múltiplos valores. O componente é estilizado e pode ser utilizado em diferentes orientações (horizontal ou vertical), além de permitir a customização através de classes CSS.",
    "lastUpdated": "2025-06-09T17:56:57.383Z"
  },
  "src/components/ui/sonner.tsx": {
    "md5": "6ea1f5a74a5c8a3463d405fcd3099771",
    "description": "O arquivo `sonner.tsx` define um componente `Toaster` que utiliza a biblioteca `sonner` para exibir notificações. Ele integra suporte a temas com base na configuração do tema atual do usuário, permitindo personalizar a aparência das notificações com estilos CSS específicos.",
    "lastUpdated": "2025-06-09T17:57:00.555Z"
  },
  "src/components/ui/switch.tsx": {
    "md5": "2d594fea843a32084e16e569f7514e41",
    "description": "O arquivo `switch.tsx` define um componente de interruptor (switch) utilizando a biblioteca Radix UI, integrando-o com o contexto de formulários do React Hook Form. Ele registra o estado do interruptor no formulário, permite a manipulação do valor e exibe mensagens de erro caso existam. O componente também inclui um rótulo associado e estiliza o interruptor com classes CSS personalizadas.",
    "lastUpdated": "2025-06-09T17:57:02.892Z"
  },
  "src/components/ui/table.tsx": {
    "md5": "d39105069fbb4f62c72092e556797480",
    "description": "O arquivo `table.tsx` define componentes React para criar uma tabela estilizada, incluindo elementos como `Table`, `TableHeader`, `TableBody`, `TableFooter`, `TableRow`, `TableHead`, `TableCell` e `TableCaption`. Cada componente aplica classes CSS específicas e permite a passagem de propriedades adicionais, facilitando a construção de tabelas responsivas e personalizáveis em aplicações React.",
    "lastUpdated": "2025-06-09T17:57:04.555Z"
  },
  "src/components/ui/tabs.tsx": {
    "md5": "65854b541abbc3c9f39cb075d4cb43ca",
    "description": "O arquivo `tabs.tsx` define componentes personalizados para um sistema de abas utilizando a biblioteca Radix UI. Ele inclui os componentes `Tabs`, `TabsList`, `TabsTrigger` e `TabsContent`, que permitem criar uma interface de abas estilizada e funcional, facilitando a navegação entre diferentes conteúdos em uma aplicação React.",
    "lastUpdated": "2025-06-09T17:57:05.985Z"
  },
  "src/components/ui/textarea.tsx": {
    "md5": "04f9af2a78672f7018b16db2bcec5036",
    "description": "O arquivo `textarea.tsx` define um componente React chamado `Textarea`, que renderiza um elemento `<textarea>` estilizado com classes CSS personalizadas. Ele aceita propriedades adicionais e permite a personalização da classe através da prop `className`, mantendo funcionalidades como foco, estado de erro e responsividade.",
    "lastUpdated": "2025-06-09T17:57:07.243Z"
  },
  "src/components/ui/toggle-group.tsx": {
    "md5": "a68b5be2c6b0ce6526a95d195b448810",
    "description": "O arquivo `toggle-group.tsx` define um componente de grupo de botões de alternância (toggle group) utilizando a biblioteca Radix UI. Ele cria um contexto para gerenciar variantes e tamanhos dos botões, permitindo que os itens dentro do grupo herdem essas propriedades. O componente `ToggleGroup` encapsula os itens de alternância, enquanto o `ToggleGroupItem` representa cada botão individual, aplicando estilos e comportamentos conforme o contexto.",
    "lastUpdated": "2025-06-09T17:57:09.165Z"
  },
  "src/components/ui/toggle.tsx": {
    "md5": "df65c0dfce4225ad57a1901b01580f54",
    "description": "O arquivo `toggle.tsx` define um componente de toggle personalizado utilizando React e a biblioteca Radix UI. Ele aplica estilos variáveis com base em variantes de aparência e tamanho, permitindo a personalização do componente. O toggle é configurado para responder a estados de ativação e desativação, e pode ser utilizado em interfaces de usuário para alternar entre opções.",
    "lastUpdated": "2025-06-09T17:57:11.388Z"
  },
  "src/components/ui/tooltip.tsx": {
    "md5": "9f753bf8201bd05dae554f6808586391",
    "description": "O arquivo `tooltip.tsx` define componentes de tooltip utilizando a biblioteca Radix UI, incluindo `Tooltip`, `TooltipTrigger`, `TooltipContent` e `TooltipProvider`. Ele permite a criação de tooltips personalizáveis com animações e estilos, facilitando a exibição de informações adicionais ao passar o mouse sobre elementos.",
    "lastUpdated": "2025-06-09T17:57:12.945Z"
  },
  "src/config/auth.ts": {
    "md5": "275e614f76f6d9b119489dc5b95ccad4",
    "description": "O arquivo `auth.ts` configura um sistema de autenticação, permitindo habilitar ou desabilitar a autenticação, definir rotas de redirecionamento, gerenciar chaves de token e fornecer mensagens de feedback para ações de login, registro e logout.",
    "lastUpdated": "2025-06-09T17:57:14.141Z"
  },
  "src/contexts/auth-context.tsx": {
    "md5": "f8e90e08dc729bd3c07b21e8ec952603",
    "description": "O arquivo `auth-context.tsx` implementa um contexto de autenticação em uma aplicação React, fornecendo funcionalidades para login, registro, logout e verificação de autenticação. Ele gerencia o estado do usuário, controla o carregamento e armazena dados de autenticação no `localStorage`. Além disso, permite desabilitar o sistema de autenticação e exibe mensagens de feedback ao usuário.",
    "lastUpdated": "2025-06-09T17:57:15.779Z"
  },
  "src/hooks/use-info/use-info.tsx": {
    "md5": "65c418f758789eb832b9be927b9407b6",
    "description": "O arquivo `use-info.tsx` define um hook personalizado utilizando Zustand para gerenciar o estado de informações de um usuário. Ele armazena um objeto `info` do tipo `User['INFO']`, permitindo que seja definido e persistido no armazenamento local com o nome 'info-storage'.",
    "lastUpdated": "2025-06-09T17:57:17.357Z"
  },
  "src/hooks/use-mobile.ts": {
    "md5": "209b5193af16624cdd89d3591480dd48",
    "description": "O arquivo `use-mobile.ts` define um hook React chamado `useIsMobile`, que determina se a largura da tela do dispositivo é menor que 768 pixels, indicando um dispositivo móvel. Ele utiliza o `matchMedia` para monitorar mudanças na largura da tela e atualiza o estado `isMobile` conforme necessário.",
    "lastUpdated": "2025-06-09T17:57:18.862Z"
  },
  "src/hooks/use-modal/use-modal.tsx": {
    "md5": "82ba81c8d660644e26683c11dd71ffec",
    "description": "O arquivo `use-modal.tsx` implementa um gerenciador de modais em React, permitindo abrir e fechar múltiplos modais. Ele define um contexto (`ModalContext`) para compartilhar o estado dos modais e fornece um `ModalProvider` que renderiza os modais abertos. A função `useModal` permite que componentes acessem o gerenciador de modais, facilitando a manipulação de modais em toda a aplicação.",
    "lastUpdated": "2025-06-09T17:57:21.231Z"
  },
  "src/lib/utils.ts": {
    "md5": "5a6fd53fdcf2be529e9cc0b718fde352",
    "description": "O arquivo `utils.ts` define uma função chamada `cn` que combina e mescla classes CSS utilizando as bibliotecas `clsx` e `tailwind-merge`. A função aceita múltiplos valores de classe e retorna uma string de classes CSS unificadas, removendo duplicatas e resolvendo conflitos.",
    "lastUpdated": "2025-06-09T17:57:24.623Z"
  },
  "src/stories/Button.stories.ts": {
    "md5": "f68e1ff401b90692ae39bbe10d723db8",
    "description": "O arquivo `Button.stories.ts` configura histórias para o componente `Button` utilizando o Storybook. Ele define metadados, como título e parâmetros de layout, e cria várias variantes do botão (primário, secundário, grande e pequeno) com diferentes propriedades. Além disso, permite a personalização da cor de fundo e registra uma função para monitorar cliques no botão.",
    "lastUpdated": "2025-06-09T17:57:26.692Z"
  },
  "src/stories/Button.tsx": {
    "md5": "bddcafa7fa05e792bf35bde3efc4888f",
    "description": "O arquivo `Button.tsx` define um componente de botão reutilizável em React, permitindo personalização de estilo, tamanho e ação de clique. Ele aceita propriedades como `primary`, `backgroundColor`, `size` e `label`, e aplica classes CSS para diferentes estilos de botão.",
    "lastUpdated": "2025-06-09T17:57:28.043Z"
  },
  "src/stories/Header.stories.ts": {
    "md5": "de0645e75909934fddd8c32e13bd8265",
    "description": "O arquivo `Header.stories.ts` define histórias para o componente `Header` utilizando o Storybook, permitindo visualizar e testar diferentes estados do componente, como \"LoggedIn\" e \"LoggedOut\". Ele configura metadados, parâmetros e ações associadas ao componente, facilitando a documentação e a apresentação visual do mesmo.",
    "lastUpdated": "2025-06-09T17:57:29.730Z"
  },
  "src/stories/Header.tsx": {
    "md5": "46043635fa29aae3a6fc52a369cedbb2",
    "description": "O arquivo `Header.tsx` define um componente de cabeçalho para uma aplicação React, que exibe um logotipo e opções de login ou logout com base na presença de um usuário. Se um usuário estiver autenticado, é exibida uma mensagem de boas-vindas e um botão de logout; caso contrário, são apresentados botões para login e criação de conta.",
    "lastUpdated": "2025-06-09T17:57:31.371Z"
  },
  "src/stories/Page.stories.ts": {
    "md5": "e528bb99d65b3fc24d9631a14d49f4a3",
    "description": "O arquivo `Page.stories.ts` define histórias para o componente `Page` utilizando Storybook, incluindo dois estados: \"LoggedOut\" e \"LoggedIn\". A história \"LoggedIn\" simula a interação do usuário ao clicar no botão de login, verificando a presença do botão de logout após a ação.",
    "lastUpdated": "2025-06-09T17:57:33.119Z"
  },
  "src/stories/Page.tsx": {
    "md5": "f3e2cf623de0e35a7b13599a201f41ea",
    "description": "O arquivo `Page.tsx` define um componente React que renderiza uma página com um cabeçalho e conteúdo informativo sobre desenvolvimento de interfaces. Ele gerencia o estado de um usuário, permitindo login, logout e criação de conta, e inclui recomendações sobre o uso de componentes em Storybook, além de links para tutoriais e documentação.",
    "lastUpdated": "2025-06-09T17:57:34.684Z"
  },
  "src/types/properties.types.ts": {
    "md5": "11e709d4ce810d9cf7c3180715e6cdff",
    "description": "O arquivo `properties.types.ts` define uma interface TypeScript chamada `PropertySearch`, que descreve a estrutura de um objeto utilizado para buscar propriedades imobiliárias. Esta interface inclui diversas propriedades, como identificadores, características do imóvel, valores de venda e locação, informações sobre o proprietário e detalhes de localização, permitindo a tipagem e validação de dados relacionados a imóveis em um sistema.",
    "lastUpdated": "2025-06-12T11:41:16.887Z"
  },
  "src/types/user.types.ts": {
    "md5": "0941e163045ef4dcb56da9d90c577b14",
    "description": "O arquivo `user.types.ts` define uma interface TypeScript chamada `User`, que descreve a estrutura de um objeto usuário, incluindo propriedades como código, nome, senha, informações de contato, status, permissões e configurações específicas. Essa interface é utilizada para tipar dados relacionados a usuários em um sistema, garantindo consistência e segurança no acesso a essas informações.",
    "lastUpdated": "2025-06-09T17:57:38.748Z"
  },
  "src/utils/environment.ts": {
    "md5": "aa6d6a9bad2479e5298c04596712e283",
    "description": "O arquivo `environment.ts` define uma função `getUrl` que retorna a URL da API. Se a variável de ambiente `NEXT_PUBLIC_URL_API` estiver definida, ela é retornada; caso contrário, a função retorna uma URL padrão para a API.",
    "lastUpdated": "2025-06-09T17:57:40.002Z"
  },
  "tailwind.config.js": {
    "md5": "40b15808ebd6925ed5f77e8d2b233807",
    "description": "O arquivo `tailwind.config.js` configura o Tailwind CSS para um projeto, habilitando o modo escuro baseado em classe e especificando os diretórios onde o Tailwind deve procurar por classes CSS, incluindo páginas, componentes e a aplicação. Ele também permite a extensão do tema e a adição de plugins, embora atualmente não tenha extensões ou plugins definidos.",
    "lastUpdated": "2025-06-09T17:57:41.694Z"
  },
  "test.js": {
    "md5": "21d18e20bcac1b8e9f39224b29820078",
    "description": "O arquivo `test.js` é um script que utiliza a API do OpenAI para gerar descrições breves de arquivos de código, especificamente arquivos com extensões JavaScript. Ele lê o conteúdo dos arquivos, calcula seu hash MD5, carrega e salva dados de verificação em um arquivo JSON, e utiliza o modelo GPT-4 para criar uma descrição concisa do código analisado. O script também inclui tratamento de erros e inicialização da API do OpenAI.",
    "lastUpdated": "2025-06-12T11:41:18.319Z"
  },
  "tests/e2e/example-new-test.spec.ts": {
    "md5": "5ebd40fb44d34b4ba3f45eece176069b",
    "description": "O arquivo `example-new-test.spec.ts` contém testes automatizados utilizando Playwright para verificar a funcionalidade de uma página web. Ele inclui testes para verificar a visibilidade de elementos, interações com formulários, responsividade em diferentes tamanhos de tela, captura de screenshots, medição de tempo de carregamento e execução de múltiplas ações em sequência.",
    "lastUpdated": "2025-06-09T17:57:45.227Z"
  },
  "tests/e2e/homepage.spec.ts": {
    "md5": "40d6ed2d78c0dd3b391557b5c3c78ed9",
    "description": "O arquivo `homepage.spec.ts` contém testes automatizados usando Playwright para verificar a funcionalidade da página principal de um site. Ele valida se elementos como título, descrição, cards de funcionalidades, variantes e tamanhos de botões, além de um formulário de exemplo, estão visíveis e interativos, garantindo que a página carregue corretamente e funcione como esperado.",
    "lastUpdated": "2025-06-09T17:57:46.850Z"
  },
  "tests/e2e/interactions.spec.ts": {
    "md5": "f239020b994874d89100648ce1468add",
    "description": "O arquivo `interactions.spec.ts` contém testes automatizados utilizando Playwright para verificar interações avançadas em uma página web. Ele testa a visibilidade e o comportamento de botões ao passar o mouse e clicar, a navegação por teclado em campos de formulário, o preenchimento de um campo com dados inválidos, o scroll da página e a captura de screenshots da página.",
    "lastUpdated": "2025-06-09T17:57:48.720Z"
  },
  "vitest.config.ts": {
    "md5": "163a16d8d67b2822c8da9faf034bd514",
    "description": "O arquivo `vitest.config.ts` configura o Vitest para executar testes automatizados em histórias definidas no Storybook, utilizando o plugin `storybookTest`. Ele especifica a configuração do ambiente de teste, incluindo o uso do Playwright para testes em um navegador Chromium em modo headless, além de definir arquivos de configuração e setup para os testes.",
    "lastUpdated": "2025-06-09T17:57:50.405Z"
  },
  "vitest.shims.d.ts": {
    "md5": "9cf5890a1d960f038fb6f7337b6ebb6f",
    "description": "O arquivo `vitest.shims.d.ts` é uma definição de tipo TypeScript que referencia os tipos fornecidos pelo Vitest para integração com o Playwright no contexto de testes em um ambiente de navegador.",
    "lastUpdated": "2025-06-09T17:57:51.867Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/parts/index.tsx": {
    "md5": "fb0027a4db4622ad115d8f1da8a07f83",
    "description": "O arquivo `index.tsx` exporta componentes relacionados a filtros de listagem de propriedades, permitindo a utilização organizada e centralizada desses componentes em outras partes da aplicação.",
    "lastUpdated": "2025-06-12T11:40:08.162Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/parts/properties-listing-filters--additional-filters.tsx": {
    "md5": "464399d97ff0761ddcb76476d7206bcf",
    "description": "O arquivo define um componente React chamado `PropertiesListingFiltersAdditionalFilters`, que apresenta uma seção de filtros adicionais para listagens de imóveis. Ele inclui checkboxes para opções como imóveis com fotos, desatualizados, destaques e oportunidades, permitindo que os usuários refinem suas buscas.",
    "lastUpdated": "2025-06-12T11:40:09.348Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/parts/properties-listing-filters--company-filters.tsx": {
    "md5": "30785119313968b50b08bde39a540e73",
    "description": "O arquivo define um componente React que exibe uma seção de filtros para listar imóveis, permitindo ao usuário filtrar por imóveis da própria imobiliária e aqueles cadastrados por ele.",
    "lastUpdated": "2025-06-12T11:40:10.430Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/parts/properties-listing-filters--finality-section.tsx": {
    "md5": "c7f2a07227fcaf8dc720f84931ee0b86",
    "description": "O arquivo define um componente React chamado `PropertiesListingFiltersFinality`, que exibe uma seção de filtros para selecionar múltiplas finalidades de imóveis, como venda, locação e temporada, utilizando checkboxes.",
    "lastUpdated": "2025-06-12T11:40:11.981Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/parts/properties-listing-filters--property-characteristics.tsx": {
    "md5": "3b145061667d00829d9823f943f6083f",
    "description": "O arquivo define um componente React que apresenta uma seção de filtros para listar propriedades, permitindo ao usuário filtrar imóveis com base no número de dormitórios, suítes e vagas disponíveis.",
    "lastUpdated": "2025-06-12T11:40:13.184Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/parts/properties-listing-filters--special-features.tsx": {
    "md5": "d03f2644b525ac618363e1ec6751785c",
    "description": "O arquivo define um componente React que exibe uma seção de filtros para listar propriedades, permitindo que os usuários selecionem características especiais como piscina, vista para o mar e sacada através de checkboxes.",
    "lastUpdated": "2025-06-12T11:40:14.403Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/properties-listing-filters.ctrl.tsx": {
    "md5": "cb2fd59a97c8fa47e7141e671da0d754",
    "description": "O arquivo `properties-listing-filters.ctrl.tsx` define um hook que gerencia a lógica de um formulário de filtros para listagem de propriedades. Utiliza `react-hook-form` para manipulação de estado e validação com `zod`, permitindo aplicar e resetar filtros com base em dados recebidos. O hook também fornece opções de seleção para disponibilidade e tipos de propriedades, adaptando-se ao contexto de uso em dispositivos móveis.",
    "lastUpdated": "2025-06-12T11:40:16.184Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/properties-listing-filters.tsx": {
    "md5": "924a02954a27db967fbcb4c08f132559",
    "description": "O arquivo `properties-listing-filters.tsx` implementa um componente de filtros para listagem de propriedades, permitindo que os usuários filtrem imóveis com base em critérios como referência, tipo, endereço e características específicas. Utiliza a biblioteca `react-hook-form` para gerenciar o estado do formulário e inclui componentes de interface como botões, inputs e seletores, além de suportar visualização em dispositivos móveis.",
    "lastUpdated": "2025-06-12T11:40:18.080Z"
  },
  "src/_pages/properties-listing-page/components/properties-listing-filters/properties-listing-filters.types.tsx": {
    "md5": "1479bc27a959f3f3e233b6e284094235",
    "description": "O arquivo `properties-listing-filters.types.tsx` define um esquema de validação utilizando a biblioteca Zod para os filtros de listagem de propriedades imobiliárias. Ele especifica diversos campos opcionais que permitem filtrar imóveis com base em características como referência, status, finalidade, localização, valores financeiros e características físicas.",
    "lastUpdated": "2025-06-12T11:40:19.538Z"
  },
  "src/_pages/properties-listing-page/properties-listing.cols.tsx": {
    "md5": "3bd29d23287e10ae72fe99a467d61699",
    "description": "O arquivo `properties-listing.cols.tsx` define componentes React para exibir colunas em uma tabela de listagem de propriedades. Ele inclui uma coluna para mostrar imagens das propriedades, uma coluna para compartilhar links no WhatsApp e Facebook, e uma coluna para exibir referências das propriedades. Os componentes utilizam ícones e manipulam eventos de clique para interações do usuário, como visualização de imagens e compartilhamento em redes sociais.",
    "lastUpdated": "2025-06-12T11:40:21.408Z"
  },
  "src/_pages/properties-listing-page/properties-listing.ctrl.tsx": {
    "md5": "f0ae705418c264e52d34ee61a7d7764b",
    "description": "O arquivo `properties-listing.ctrl.tsx` implementa um controlador para listar propriedades, permitindo funcionalidades como busca, edição, visualização de detalhes, cópia de fotos, e relatórios. Utiliza hooks para gerenciar estado e interações, além de integrar com uma API para buscar dados de propriedades. O controlador também gerencia a exibição de imagens em tela cheia e a abertura de URLs de propriedades em novas abas.",
    "lastUpdated": "2025-06-12T11:40:23.304Z"
  },
  "src/_pages/properties-listing-page/properties-listing.tsx": {
    "md5": "fcf94af5b0d7670f0601c5d311025ea4",
    "description": "O arquivo `properties-listing.tsx` implementa um componente React que exibe uma lista de imóveis, permitindo a filtragem e a paginação dos resultados. Inclui um cabeçalho com um botão para adicionar novos imóveis, um componente de filtros, uma tabela para listar as propriedades e um controle de exibição de imagens em tela cheia. O estado e a lógica de interação são gerenciados por meio de um controlador específico.",
    "lastUpdated": "2025-06-12T11:40:25.334Z"
  },
  "src/_pages/properties-listing-page/properties-listing.types.tsx": {
    "md5": "d41d8cd98f00b204e9800998ecf8427e",
    "description": "O arquivo `properties-listing.types.tsx` define tipos TypeScript para um componente React relacionado à listagem de propriedades. Ele especifica as estruturas de dados e interfaces necessárias para garantir a tipagem correta dos dados utilizados no componente, facilitando a integração e a manutenção do código.",
    "lastUpdated": "2025-06-12T11:40:27.567Z"
  },
  "src/lib/api-utils.ts": {
    "md5": "a47aab79b4adab3d945ffa4558e67df8",
    "description": "O arquivo `api-utils.ts` define uma interface para dados de solicitação de pesquisa e uma função que converte esses dados em um formato adequado para consultas, incluindo opções de ordenação, limite e deslocamento, além de permitir a inclusão de filtros adicionais.",
    "lastUpdated": "2025-06-12T11:41:13.243Z"
  },
  "src/lib/format.ts": {
    "md5": "79b944f859dd3af3fcc74a3d00adbe8f",
    "description": "O arquivo `format.ts` contém uma função chamada `formatPrice` que formata um valor numérico representando um preço em reais brasileiros (BRL). Se o preço for indefinido, retorna \"N/A\"; caso contrário, retorna o preço formatado como moeda, sem casas decimais.",
    "lastUpdated": "2025-06-12T11:41:14.466Z"
  }
}